Ran Plan for dir: `terraform/bootstrap` workspace: `default`

**Plan Error**
<details><summary>Show Output</summary>

```
running "/home/atlantis/.atlantis/bin/terraform1.8.1 plan -input=false -refresh -out \"/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/58/default/terraform/bootstrap/bootstrap-prod-default.tfplan\"" in "/home/atlantis/.atlantis/repos/ryu-qqq/Infrastructure/58/default/terraform/bootstrap": exit status 1
data.aws_iam_openid_connect_provider.github: Reading...
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=646886795421]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform planned the following actions, but then encountered a problem:

  # aws_dynamodb_table.terraform-lock will be created
  + resource "aws_dynamodb_table" "terraform-lock" {
      + arn              = (known after apply)
      + billing_mode     = "PAY_PER_REQUEST"
      + hash_key         = "LockID"
      + id               = (known after apply)
      + name             = "prod-connectly-tf-lock"
      + read_capacity    = (known after apply)
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags             = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all         = {
          + "Component"   = "dynamodb"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly-tf-lock"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + write_capacity   = (known after apply)

      + attribute {
          + name = "LockID"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled                 = true
          + recovery_period_in_days = (known after apply)
        }

      + server_side_encryption {
          + enabled     = true
          + kms_key_arn = (known after apply)
        }
    }

  # aws_kms_alias.terraform-state will be created
  + resource "aws_kms_alias" "terraform-state" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + name           = "alias/terraform-state"
      + name_prefix    = (known after apply)
      + target_key_arn = (known after apply)
      + target_key_id  = (known after apply)
    }

  # aws_kms_key.terraform-state will be created
  + resource "aws_kms_key" "terraform-state" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + deletion_window_in_days            = 30
      + description                        = "KMS key for Terraform state encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + rotation_period_in_days            = (known after apply)
      + tags                               = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                           = {
          + "Component"   = "kms"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "terraform-state-encryption"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
    }

  # aws_s3_bucket.terraform-state will be created
  + resource "aws_s3_bucket" "terraform-state" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "prod-connectly"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + tags_all                    = {
          + "Component"   = "s3"
          + "CostCenter"  = "infrastructure"
          + "DataClass"   = "internal"
          + "Environment" = "prod"
          + "Lifecycle"   = "permanent"
          + "ManagedBy"   = "terraform"
          + "Name"        = "prod-connectly"
          + "Owner"       = "platform@ryuqqq.com"
          + "Project"     = "infrastructure"
          + "Service"     = "terraform-backend"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # aws_s3_bucket_lifecycle_configuration.terraform-state will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "terraform-state" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + transition_default_minimum_object_size = "all_storage_classes_128K"

      + rule {
          + id     = "expire-old-versions"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + filter {
                # (1 unchanged attribute hidden)
            }

          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
        }
      + rule {
          + id     = "delete-incomplete-multipart-uploads"
          + status = "Enabled"
            # (1 unchanged attribute hidden)

          + abort_incomplete_multipart_upload {
              + days_after_initiation = 7
            }

          + filter {
                # (1 unchanged attribute hidden)
            }
        }
    }

  # aws_s3_bucket_policy.terraform-state will be created
  + resource "aws_s3_bucket_policy" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

  # aws_s3_bucket_public_access_block.terraform-state will be created
  + resource "aws_s3_bucket_public_access_block" "terraform-state" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.terraform-state will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + rule {
          + apply_server_side_encryption_by_default {
              + kms_master_key_id = (known after apply)
              + sse_algorithm     = "aws:kms"
            }
        }
    }

  # aws_s3_bucket_versioning.terraform-state will be created
  + resource "aws_s3_bucket_versioning" "terraform-state" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

Plan: 9 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + dynamodb_table_arn  = (known after apply)
  + dynamodb_table_name = "prod-connectly-tf-lock"
  + kms_key_alias       = "alias/terraform-state"
  + kms_key_arn         = (known after apply)
  + kms_key_id          = (known after apply)
  + s3_bucket_arn       = (known after apply)
  + s3_bucket_name      = (known after apply)
╷
│ Error: finding IAM OIDC Provider by url (https://token.actions.githubusercontent.com): operation error IAM: ListOpenIDConnectProviders, https response error StatusCode: 403, RequestID: 716fdac0-eb62-446e-bbef-342c84eb8394, api error AccessDenied: User: arn:aws:sts::646886795421:assumed-role/atlantis-ecs-task-prod/6085d887dc454339970d4535ab6315fe is not authorized to perform: iam:ListOpenIDConnectProviders on resource: arn:aws:iam::646886795421:oidc-provider/* because no identity-based policy allows the iam:ListOpenIDConnectProviders action
│ 
│   with data.aws_iam_openid_connect_provider.github,
│   on github-actions.tf line 6, in data "aws_iam_openid_connect_provider" "github":
│    6: data "aws_iam_openid_connect_provider" "github" {
│ 
╵

```
</details>